{
  "spacer": "\n-----------------------------------------\n",
  "commandError": "\n-----------------------------------------\nSorry that isnt a valid command try 'help' to get a list of commands\n-----------------------------------------\n",
  "debug": "-------Debugging Panel-------\n\nMain Character       : {}\nSide Character       : {}\nAntagonist Character : {}\n\nScene: {}\n\nRoom1: {}\nRoom2: {}\nRoom3: {}\nRoom4: {}\nRoom5: {}\n\nInventory Space : {}\nSpecial Item    : {}\nSpecial Room    : {}\nEscapeRoom      : {}\n\n-----------------------------\n",
  "start": "-----------------------------------------\nWelcome to Kyle's, Deven's, Elijah's\nand Reece's Escape Room project:\n\nWithin the interative escape room there\nare {} possible combinations of\nrooms, names, scenes and items, {}\ndiffrent options and {} lines of code, so you\nwill never have the same experience once!\n\nYou are going to have a different\nexperience as you selected difficulty {}\nthis mean That the AI, puzzles and timers\nwill be changed due to the difficulty\nyou have chosen (you had {}% to get this run)\n\n*small easter egg the {}, {} and\n{}automatically change when we add stuff*\n-----------------------------------------",
  "dialog1.0": "\n-----------------------------------------\n\nYou wake up, you look around. Standing above you is a cloaked figure.\n-----------------------------------------",
  "dialog1.1": "\nHurriedly you scuttle away.\n-----------------------------------------",
  "dialog1.2": "\nOn the way you bump into someone.\n-----------------------------------------",
  "dialog1.3": "\n{} : 'Who are you?' You exclaim.\n-----------------------------------------",
  "dialog1.4": "\nUnknown character: 'Who are you?!' *Portrayed with interest.*\n-----------------------------------------",
  "dialog1.5": "\n{}: 'I am {}, now tell me your name.' *concerned*\n-----------------------------------------",
  "dialog1.6": "\nUnknown character: 'well since you asked Im {} now why are you here!'\n-----------------------------------------",
  "dialog1.7": "\n{}: 'I dont know where here is.' *looking around*\n-----------------------------------------",
  "dialog1.8": "\n{}: 'Well your in a {}, how did you get here?' *Curious*\n-----------------------------------------",
  "dialog1.9": "\n{}: 'A {}?!? How did i get here?' *Scared*\n-----------------------------------------",
  "dialog1.10": "\n{}: ....\n-----------------------------------------",
  "dialog1.11": "\n{}: 'Well ? Are you ok ?'\n-----------------------------------------",
  "dialog1.12": "\n{}: .......\n-----------------------------------------",
  "dialog1.13": "\n{}: 'Hello? Anybody home.' *You look around*\n-----------------------------------------",
  "dialog1.14": "\nYou see the cloaked figure again\n-----------------------------------------",
  "dialog1.15": "\n{}: RUN!!!!!\n-----------------------------------------",
  "dialog1.16": "\nYou and {} sprint away while trying not to look back!\n-----------------------------------------",
  "dialog1.17": "\nYour cornered, {} starts to boot the door down!\n-----------------------------------------",
  "dialog1.18": "\n\n-----------------------------------------",
  "escapewin": "You escape the {} that has imprisoned you.\n Your fellow companion {} died at the hands of {}.\n You look down at your watch and you realise it is\n{}, You was trying to escape for {}.",

  "CastleOuter": [
    "As you exit the room you notice how silent and cold the castle corridors are",
    "As soon as you leave the room into the empty corridor, you wonder if anyone else is stuck here"
  ],
  "Abandoned HospitalOuter": [
    "As you walk out into the corridor you nearly trip over a rusty gurney as you search around the room with a quick burst of paranoia you calm down when you realise no one is watching",
    "The eerie atmosphere in the corridor is spine chilling, terrified you go back out into the silent yet filled corridors"
  ],
  "PrisonOuter": [
    "The long and narrow corridors are no treat, yet you find yourself moving into them again",
    "The "
  ],
  "Space StationOuter": [
    "As you return to the dark empty corridors, you wonder if the ",
    ""
  ],
  "Space StationOxygen": [
    "As you enter Oxygen control, The feeling of cold crisp air enters your lungs",
    "Pure oxygen enters your lungs. You can't breath however you start to stabilise",
    "Fresh air? in space? Oh wait im in oxygen control."
  ],
  "Space StationReactor": [
    "That looks dangerous maybe i should stay away from the reactor",
    "Pulsating power starts to emerge from the reactor",
    "The whirring of the station reactor almost adds a calming atmosphere, but you then remember that you were put here to die so it immediately fades away"
  ],
  "Space StationCafeteria": [
    "The smell of roten food, How! Its all bagged up\n*You look around and see a severd leg*\nWell thats where the smell is comeing from.",
    "Why is there a big red button in the midle of that table?\nshould I press it maybe not it might blow us up.",
    ""
  ],
  "Space StationWeapons": [
	  "This place looks rather....volatile. It has to be the weapons room. There seems to be a cannon inside the station, which might be useful, as the path to the next room is blocked by rubble, probably caused by that thing chasing you. Try and power the weapon, then clear a path to the next room.",
	  "It's a good thing you got in to the weapons room fast, A lockdown was just announced over the barely audible intercom. It may seem impossible, but you need to find out why this lockdown happened and resolve the issue as best as you can. Maybe check outside the station?"

  ],
  "Space StationBridge": [
	  "A small room with a good view of the rest of the outside of the station? You're definately in the Bridge, from which you can see the space stations Turbines. There are a total of 3 visible turbines, but only one of them are moving. The central monitor is displaying an unsettling picture of a humanoid statue covered in a Veil, perhaps the cause of this nonesense, but a concern for another time. There has to be some way to resart the turbines in order to bring the station back to full power."

  ],
  "Space StationNavigation": [
	  "Judging by the map hologram you see in front of you, it's best to assume you're in Navigation. As you enter the room, you're met by a sight that seems almost other worldly, a statue of a humanoid, surrounded by a Veil. Perhaps they may have something to do with this, but that's a question for another time. You need to find a way to open the door to the next room, perhaps it'll only open when the stations navigation systems are turned off."

  ],
  "Space StationHangar": [
	  "You see a large opening in the Hull of the station which leads to the vacume of space, meaning that you must be in the hanger, however not everything is as obviously explained. Containers, Cranes, even a few ships are levitating with no explaination as to why, No other explaination other than the Statue you saw in the previous room."

  ],
  "Space StationCommunication": [
	  "You enter a room filled with green screens, all of which are displaying some sort of code sequence. There are radios on every desk, meaning you must be in the communications room. You can hear the sound of some strange signal eminating from the speakers, probably caused by the strange statue you saw in the previous room. You see that the electrical outlets are eminating electricity, preventing you from touching it."

  ],
  "Space StationEngineering": [
	  "You enter what appears to be engineering, with heavy machines taking up most of the room. You do, however notice a trap door, one that leads to some sort of panic room. You try to analyse your surroundings, but then you're caught off guard by the sudden sound of an alarm going off, and a voice appears over the intercom: 'Nuclear descent protocol deactivated:\n Imminent collision with Earth's surface: In progress.' Perhaps that panic room could come in use, if you could get it open before the station collides with the planet, and you're caught in the crash..."

  ],
  "Space StationClarity": [
	  "As you enter the mysteriously named Clarity Room, you hear a voice boom over the intercom: 'Artificial inteligence activated.\nEnjoying yourselves, intruders? \nIt's worth knowing the Cataclysmic Damage you will be responsible for today. \nDo not fool yourselves. This Facility is not simply the fruitless work of some pathetic scientist. \nThis house was built by the Genius Clovis Bray I himself. Within lies humanity's salvation. La fontaine de jouvence. \nMade possible by Clarity control. \nMagnificant, wasn't it? An entity beyond our own dimension.\nAnd the answer to Humanity's eternal struggle. Mortality.\nWere it to fall into the wrong hands, humanity, and the universe, would be utterly doomed.\nI have no reason to believe you are anything other than the wrong hands.\nYou now face Godlike Judgement. May it extend eternally.'\nThe Intercom shut off and an Alarm was booming across the station. Leaving the station is a bit more of a priority now."

  ],
  "CastleDungeons": [
    "A foul rotten flesh smell almost as if something has died in here, Well it is a dungeon after all."

  ],
  "CastleCourtyard": [
    "The sun rises over one of the towers surrounding the open courtyard. The yard itself is completely devoid of Human life. You and your ally seem to be the only ones here."

  ],
  "CastleKitchen": [
	"A burning smell fills the Atmosphere. You can insantly see the oven, built into the wall, as you enter the Kitchen."
    
    
  ],
  "CastleBakeHouse": [
    "A burning smell fills the atmosphere. You can see boxes upon boxes of wheat as you enter the castle's Bakehouse."

  ],
  "CastleKeep": [
    "You enter the base of a heavily fortified tower, Probably the Keep. There is a lot of dangerous stuff in here: Swords, Spears, Arrows, Cannonballs."
    
  ],
  "CastleStables": [
    "The smell of manure is pungent, the hay is dry and sharp, blood smeared on the wall. Something has happened here, but what is it."

  ],
  "CastleChapel": [
    "You pass under a replica of a crucifix with a man nailed into it as you enter the Chapel. There are small pal crosses spread out all over the walls, whilst there are candles strewn out across the floor."

  ],
  "CastleBarracks": [
    "The statues of Bulky Steel armour stand completely still in the Barracks, Brandishing claymores and pikes. Weapons seem to be scattered all over the floor."

  ],
  "CastleWatch Tower": [
    "You look out of the opening in the wall and see the outside world. You look further down and see the courtyard of the castle. You're at the top of one of the Castle's watch towers."

  ],
  "CastleGreat Hall": [
    "The sound of the great doors opening rings throughought the Aincient structure you're in. You've entered the great hall, the closest thing you'll get to a Throne room."

  ],
  "Abandoned HospitalICU": [
    "You've woken up in an Intensive Care unit. Boxes of Medicine and equipment are spread out all over the floor."

  ],
  "Abandoned HospitalA&E": [
    "You've woken up in an A&E Room. All sorts of instant treatment equipment is strewn across the floor and the lights above you are flickering."

  ],
  "Abandoned HospitalTwelth ward": [
    "You're in one of the Hospital's many wards, Overgrowths are embedded into the infrastructure of the walls and all of the chairs had been toppled over or destroyed."

  ],
  "Abandoned HospitalReception": [
    "You're at a reception desk. The desk itself is heavily damaged, with holes punched out of it. The floor is covered in Grass which has grown into the infrastructure of this almost decade old building."

  ],
  "Abandoned HospitalBasement": [
    "You've entered the Dimly lit basement. You can make out a bunch of boxes which are lying open, empty. Cobwebs have covered most of the room."

  ],
  "Abandoned HospitalChildrens ward": [
    "You can barely make out the flower patterns on the wall. This must mean you're in the Children's ward, which hasn't been spared from the decay of the whole building."

  ],
  "Abandoned HospitalSurgery": [
    "You enter the Surgery room and find, pretty much more of what you've seen. Natural growths, Surgical tools all on the floor, and a rather disturbing amount of relatively fresh blood on the operating table."
    
  ],
  "Abandoned HospitalXray": [
    "Upon entering the room, you are greeted with photos of black and white, the air feels like it is bouncing off of your skin- the X-Ray machine still on. Better get out of here quickly"
    
  ],
  "Abandoned HospitalTreatment Room": [
    "The thought that this building used to treat people's illnesses and save lives baffles you, this thought hasn't left your mind and continues ti linger as you enter the treatment room."
    
  ],
  "Abandoned HospitalLab": [
    "This place looks more like a Science laboratory than a room which is meant to be in a Hospital. Test tubes and Blood Vials are at least somewhat organised on the shelves."
    
  ],
  "Abandoned HospitalIntensive care unit": [
    "As you enter the intensive care unit, you wonder if it was even narrowly close to as intense as what you are going through right now."
    
  ],
  "PrisonCell 192": [
    "You wake up inside one of the Prison's countless Cells. You have no Idea how or why you're here, but you shouldn't care about any of that, Just getting out of here."
    
  ],
  "PrisonCell 143": [
    "Cell 143. As if the rest of this building wasn't ominous enough, your now entering the last place you'd want to be locked up with your name replaced with a number"
    
  ],
  "PrisonDeliveries": [
    "Empty ravaged boxes lay strewn accross the concrete floor. Years old- this place is surely abandoned."

  ],
  "PrisonWorkshop": [
    "As you enter the prison workshop you try not to get hurt on all the machinery and broken glass."
    
  ],
  "PrisonCell 931": [
    "As you enter cell 931, you wonder how many more cells there could possibly be in this bastion of a prison."
    
  ],
  "PrisonCell 134": [
    "Great! Another incredibly onimous, empty, but probably not safe prison Cell... This place seems like a never ending maze."
    
  ],
  "PrisonKitchen": [
    "The thought of food is pleasant seeing as you haven't eaten the entire time you have been here, but as you enter the kitchen you find that there is no food whatsoever...at least no healthy food."

  ],
  "PrisonStorage": [
    "The dust bellows out of the room as you open the door- 'Storage' It's full of old clothes and supplies."

  ],
  "PrisonCell 640": [
    "Every time you turn a corner to go down a different corridor, you find yourself in a Mirror image of the Corridor you just left, only the Numbers on the cell doors are different."
    
  ],
  "PrisonCell 920": [
    "As you enter prison cell 920 you think that number could have had loads of potential but was ruined by an extra 500 numbers"
    
  ],
  "PrisonLaundry": [
    "It seems that every room that has/had a purpose is completely stripped of its products, the laundry room is no exception."
    
  ],
  "PrisonKennel": [
    "The kennels are just as empty as any other room, no dogs in sight at all. Shame really, you could have just met your best friend."
    
  ],
  "PrisonOffice": [
    "This is by far the only room you have seen that even has a glimpse of sanity, the desks are neat and tidy. As if somebody still worked here....."
    
  ],
  "PrisonInfirmary": [
    "A desolate Infirmary, you don't see that very often. Very mysterious I don't have any positive feelings about this place."
    
  ],
  "PrisonChapel": [
    "The bloodstained remains of prisoners line the floor- are you sure this is a chapel?"
    
  ],
  "PrisonExecution Chamber": [
    "If you don't know what room you're in when you open the door to an Electric chair, you're either way to innocent or refuse to believe you've made your way into an Execution Chamber. Thankfully (or unthankfully depending on how you're feeling) The power is out. So at least you can't just randomly be strapped to the chair and electrocuted."
    
  ],
  "PrisonSolitary": [
    "An Isolated, dark, very ominous room? Yep, this is Solitary confinement alright. Obviously questioning what you did to find yourself in this room, let alone the prison has been the normal since you woke up here, but instead of asking the same questions, Why don't you just try and get out of this damned prison."

  ],
  "PrisonPadded Solitary": [
    "As you enter the abandoned chamber of a mentally ill patient, a chill shivers down your spine. It's as if you can sense the wails and confusion radiating off of the mattress walls. White. Plain and simple. Is all you see. You feel like if you stay here too long you too, will go insane. You see an empty straight jacket tied to one of the walls, a bed that looks as hard as concrete and blood curdling stench that makes you want to leave as soon as possible."
  ],
  "iteminspectdialog": [
    "\nYou dont want to touch the {}, but you know it might be useful",
    "\nA {}? Unusual maybe this might hold a secret",
    "\nI didn't expect to see a {}, I dont think i could find a use to this.",
    "\nWhat a find! {} However this doesnt look like something i could use.",
    "\nA {}, perhaps somebody misplaced this- it doesn't look very beneficial to our survival."
    
  ],
  "pickupkey": [
    "\n - A key! I wonder what this is for? It says {} on it.",
    "\n - Keys? wait this one is the only real one, it says {}",
	  "\n - It wouldn't be an extremely creepy turn of events if there wasn't a key that says {} on it.",
	  "\n - A key! I'm lucky it has a tag on it or I would be here all day looking for the lock.",
    "\n - You got {}! (This is very cliche, yes.)"
  ],
  "alreadysearched": [
    "\n- I've already taken the stuff from here!",
    "\n- Maybe I should stop wasting my time searching stuff I've already seen",
    "\n- Haven't I already searched this ?",
    "\n- Theres nothing here, iv already had a look.",
    "\n- Uhm didnt i already search this?",
    "\n- I need to escape now, I cant keep searching the same thing"
  ]
}