{
  "spacer": "\n-----------------------------------------\n",
  "debug": "-------Debugging Panel-------\n\nMain Character       : {}\nSide Character       : {}\nAntagonist Character : {}\n\nScene: {}\n\nRoom1: {}\nRoom2: {}\nRoom3: {}\nRoom4: {}\nRoom5: {}\n\nInventory Space : {}\nSpecial Item    : {}\nSpecial Room    : {}\n\n-----------------------------\n",
  "start": "-----------------------------------------\nWelcome to Kyle's, Deven's, Elijah's\nand Reece's Escape Room project:\n\nWithin the interative escape room there\nare 1,966,080 possible combinations of\nrooms, names, scenes and items so you\nwill never have the same experience once!\n\nYou are going to have a different\nexperience as you selected difficulty {}\nthis mean That the AI, puzzles and timers\nwill be changed due to the difficulty\nyou have chosen\n-----------------------------------------",
  "dialog1.0": "\n-----------------------------------------\n\nYou wake up, you look around. Standing above you is a cloaked figure.\n-----------------------------------------",
  "dialog1.1": "\nHurriedly you scuttle away.\n-----------------------------------------",
  "dialog1.2": "\nOn the way you bump into someone.\n-----------------------------------------",
  "dialog1.3": "\n{} : 'Who are you?' You exclaim.\n-----------------------------------------",
  "dialog1.4": "\nUnknown character: 'Who are you?!' *Portrayed with interest.*\n-----------------------------------------",
  "dialog1.5": "\n{}: 'I am {}, now tell me your name.' *concerned*\n-----------------------------------------",
  "dialog1.6": "\nUnknown character: 'well since you asked Im {} now why are you here!'\n-----------------------------------------",
  "dialog1.7": "\n{}: 'I dont know where here is.' *looking around*\n-----------------------------------------",
  "dialog1.8": "\n{}: 'Well your in a {}, how did you get here?' *Curious*\n-----------------------------------------",
  "dialog1.9": "\n{}: 'A {}?!? How did i get here?' *Scared*\n-----------------------------------------",
  "dialog1.10": "\n{}: ....\n-----------------------------------------",
  "dialog1.11": "\n{}: 'Well ? Are you ok ?'\n-----------------------------------------",
  "dialog1.12": "\n{}: .......\n-----------------------------------------",
  "dialog1.13": "\n{}: 'Hello? Anybody home.' *You look around*\n-----------------------------------------",
  "dialog1.14": "\nYou see the cloaked figure again\n-----------------------------------------",
  "dialog1.15": "\n{}: RUN!!!!!\n-----------------------------------------",
  "dialog1.16": "\nYou and {} sprint away while trying not to look back!\n-----------------------------------------",
  "dialog1.17": "\nYour cornered, {} starts to boot the door down!\n-----------------------------------------",
  "dialog1.18": "\n\n-----------------------------------------",

  "CastleOuter": [
    "filler",
    ""
  ],
  "Abandoned HospitalOuter": [
    "filler",
    ""
  ],
  "PrisonOuter": [
    "filler",
    ""
  ],
  "Space StationOuter": [
    "filler",
    ""
  ],
  "Space StationOxygen": [
    "As you enter Oxygen control, The feeling of cold crisp air enters your lungs",
    "Pure oxygen enters your lungs. You cant breath however you start to stabilise",
    "Fresh air? in space. oh wait im in oxygen control."
  ],
  "Space StationReactor": [
    "That looks dangerous maybe i should stay away from the reactor",
    "Pulsating power starts to emerge from the reactor",
    ""
  ],
  "Space StationCafeteria": [
    "The smell of roten food, How! Its all bagged up\n*You look around and see a severd leg*\nWell thats where the smell is comeing from.",
    "Why is there a big red button in the midle of that table?\nshould I press it maybe not it might blow us up.",
    ""
  ],
  "Space StationWeapons": [
	  "This place looks rather....volatile. It has to be the weapons room. There seems to be a cannon inside the station, which might be useful, as the path to the next room is blocked by rubble, probably caused by that thing chasing you. Try and power the weapon, then clear a path to the next room.",
	  "It's a good thing you got in to the weapons room fast, A lockdown was just announced over the barely audible intercom. It may seem impossible, but you need to find out why this lockdown happened and resolve the issue as best as you can. Maybe check outside the station?"

  ],
  "Space StationBridge": [
	  "A small room with a good view of the rest of the outside of the station? You're definately in the Bridge, from which you can see the space stations Turbines. There are a total of 3 visible turbines, but only one of them are moving. The central monitor is displaying an unsettling picture of a humanoid statue covered in a Veil, perhaps the cause of this nonesense, but a concern for another time. There has to be some way to resart the turbines in order to bring the station back to full power."

  ],
  "Space StationNavigation": [
	  "Judging by the map hologram you see in front of you, it's best to assume you're in Navigation. As you enter the room, you're met by a sight that seems almost other worldly, a statue of a humanoid, surrounded by a Veil. Perhaps they may have something to do with this, but that's a question for another time. You need to find a way to open the door to the next room, perhaps it'll only open when the stations navigation systems are turned off."

  ],
  "Space StationHangar": [
	  "You see a large opening in the Hull of the station which leads to the vacume of space, meaning that you must be in the hanger, however not everything is as obviously explained. Containers, Cranes, even a few ships are levitating with no explaination as to why, No other explaination other than the Statue you saw in the previous room. You see the door to the next room, but it's at an higher elevation. You need to find a way to use whatever still functions to make a path to that door. Perhaps You can check the room to your left..."

  ],
  "Space StationCommunication": [
	  "You enter a room filled with green screens, all of which are displaying some sort of code sequence. There are radios on every desk, meaning you must be in the communications room. You can hear the sound of some strange signal eminating from the speakers, probably caused by the strange statue you saw in the previous room. You're in a hurry to leave this station, so you don't have time to look around, however you did notice a lever which might control the power. You see that one of the electrical outlets is eminating electricity, preventing you from touching it. Maybe you could make the signal clearer, then work from there."

  ],
  "Space StationEngineering": [
	  "You enter what appears to be engineering, with heavy machines taking up most of the room. You do, however notice a trap door, one that leads to some sort of panic room. You try to analyse your surroundings, but then you're caught off guard by the sudden sound of an alarm going off, and a voice appears over the intercom: 'Nuclear descent protocol deactivated:\n Imminent collision with Earth's surface: In progress.' Perhaps that panic room could come in use, if you could get it open before the station collides with the planet, and you're caught in the crash. You quickly see 4 Generators that seem to be powered, as well as some kind of core holders. You'd best find out how to power those things on."

  ],
  "Space StationClarity": [
	  "As you enter the mysteriously named Clarity Room, you hear a voice boom over the intercom: 'Artificial inteligence activated.\nEnjoying yourselves, intruders? \nIt's worth knowing the Cataclysmic Damage you will be responsible for today. \nDo not fool yourselves. This Facility is not simply the fruitless work of some pathetic scientist. \nThis house was built by the Genius Clovis Bray I himself. Within lies humanity's salvation. La fontaine de jouvence. \nMade possible by Clarity control. \nMagnificant, wasn't it? An entity beyond our own dimension.\nAnd the answer to Humanity's eternal struggle. Mortality.\nWere it to fall into the wrong hands, humanity, and the universe, would be utterly doomed.\nI have no reason to believe you are anything other than the wrong hands.\nYou now face Godlike Judgement. May it extend eternally.'\nThe Intercom shut off and an Alarm was booming across the station. You should probably find a way to stop whatever is happening."

  ],
  "CastleDungeons": [
    "A foul rotten flesh smell almost as if something has died in here, Well it is a dungeon after all.",
    ""

  ],
  "CastleCourtyard": [
    "filler"

  ],
  "CastleKitchen": [
    "filler"
    
  ],
  "CastleBakeHouse": [
    "filler"

  ],
  "CastleKeep": [
    "filler"
    
  ],
  "CastleStables": [
    "filler"

  ],
  "CastleChapel": [
    "filler"

  ],
  "CastleBarracks": [
    "filler"

  ],
  "CastleWatch Tower": [
    "filler"

  ],
  "CastleGreat Hall": [
    "filler"

  ],
  "Abandoned HospitalICU": [
    "filler"

  ],
  "Abandoned HospitalA&E": [
    "filler"

  ],
  "Abandoned HospitalTwelth ward": [
    "filler"

  ],
  "Abandoned HospitalReception": [
    "filler"

  ],
  "Abandoned HospitalBasement": [
    "filler"

  ],
  "Abandoned HospitalChildrens ward": [
    "filler"

  ],
  "Abandoned HospitalSurgery": [
    "filler"
    
  ],
  "Abandoned HospitalXray": [
    "filler"
    
  ],
  "Abandoned HospitalTreatment Room": [
    "filler"
    
  ],
  "Abandoned HospitalLab": [
    "filler"
    
  ],
  "Abandoned HospitalIntensive care unit": [
    "filler"
    
  ],
  "PrisonCell 192": [
    "filler"
    
  ],
  "PrisonCell 143": [
    "filler"
    
  ],
  "PrisonDeliveries": [
    "filler"

  ],
  "PrisonWorkshop": [
    "filler"
    
  ],
  "PrisonCell 931": [
    "filler"
    
  ],
  "PrisonCell 134": [
    "filler"
    
  ],
  "PrisonKitchen": [
    "filler"

  ],
  "PrisonStorage": [
    "filler"

  ],
  "PrisonCell 640": [
    "filler"
    
  ],
  "PrisonCell 920": [
    "filler"
    
  ],
  "PrisonLaundry": [
    "filler"
    
  ],
  "PrisonKennel": [
    "filler"
    
  ],
  "PrisonOffice": [
    "filler"
    
  ],
  "PrisonInfirmary": [
    "filler"
    
  ],
  "PrisonChapel": [
    "filler"
    
  ],
  "PrisonExecution Chamber": [
    "filler"
    
  ],
  "PrisonSolitary": [
    "filler"

  ],
  "PrisonPadded Solitary": [
    "filler"
    
  ]
}